In [1]:
import pandas as pd

In [3]:
fpath = "Resources/iris.csv"
df= pd.read_csv(fpath)
df

     sepal_length  sepal_width  petal_length  petal_width           class
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [5]:
df.pop("class")

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: class, Length: 150, dtype: object

In [7]:
df = df[["sepal_length","petal_length","sepal_width","petal_width"]]
df.head()

   sepal_length  petal_length  sepal_width  petal_width
0           5.1           1.4          3.5          0.2
1           4.9           1.4          3.0          0.2
2           4.7           1.3          3.2          0.2
3           4.6           1.5          3.1          0.2
4           5.0           1.4          3.6          0.2

In [8]:
col = df.columns.tolist()
col

['sepal_length', 'petal_length', 'sepal_width', 'petal_width']

In [17]:
col = col[-1:] + col[:-1]
col

['petal_width', 'sepal_length', 'petal_length', 'sepal_width']

In [20]:
ofpath = "Resources/iris1.csv"
df.to_csv(ofpath, index=False)

In [21]:
filepath = "Resources/shopping_data.csv"
df_s = pd.read_csv(filepath)
df_s.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [22]:
df_s.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [23]:
df_s.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [29]:
for column in df_s.columns:
    print(f'column {column} have {df_s[column].isnull().sum()} null Values')

column CustomerID have 0 null Values
column Card Member have 2 null Values
column Age have 2 null Values
column Annual Income have 0 null Values
column Spending Score (1-100) have 1 null Values

In [30]:
df_s = df_s.dropna()

In [32]:
df_s.duplicated().sum()

0

In [36]:
df_s.drop(columns=['CustomerID'], inplace = True)
df_s

    Card Member   Age  Annual Income  Spending Score (1-100)
0           Yes  19.0          15000                    39.0
1           Yes  21.0          15000                    81.0
2            No  20.0          16000                     6.0
3            No  23.0          16000                    77.0
4            No  31.0          17000                    40.0
..          ...   ...            ...                     ...
198          No  35.0         120000                    79.0
199          No  45.0         126000                    28.0
200         Yes  32.0         126000                    74.0
201         Yes  32.0         137000                    18.0
202         Yes  30.0         137000                    83.0

[200 rows x 4 columns]

In [39]:
def chg_str(member):
    if member == 'Yes':
        return 1
    else :
        return 0

In [41]:
df_s['Card Member'] = df_s['Card Member'].apply(chg_str)

In [42]:
df_s

     Card Member   Age  Annual Income  Spending Score (1-100)
0              1  19.0          15000                    39.0
1              1  21.0          15000                    81.0
2              0  20.0          16000                     6.0
3              0  23.0          16000                    77.0
4              0  31.0          17000                    40.0
..           ...   ...            ...                     ...
198            0  35.0         120000                    79.0
199            0  45.0         126000                    28.0
200            1  32.0         126000                    74.0
201            1  32.0         137000                    18.0
202            1  30.0         137000                    83.0

[200 rows x 4 columns]

In [44]:
df_s['Annual Income'] = df_s['Annual Income']/1000
df_s

     Card Member   Age  Annual Income  Spending Score (1-100)
0              1  19.0          0.015                    39.0
1              1  21.0          0.015                    81.0
2              0  20.0          0.016                     6.0
3              0  23.0          0.016                    77.0
4              0  31.0          0.017                    40.0
..           ...   ...            ...                     ...
198            0  35.0          0.120                    79.0
199            0  45.0          0.126                    28.0
200            1  32.0          0.126                    74.0
201            1  32.0          0.137                    18.0
202            1  30.0          0.137                    83.0

[200 rows x 4 columns]

In [47]:
df_s.columns.str.replace(' ','_')

Index(['Card_Member', 'Age', 'Annual_Income', 'Spending_Score_(1-100)'], dtype='object')